using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace FootballProjectSoftUni.Core.Constants
{
    public static class LiabilityDeclarations
    {
        public const string TournamentDeclarationBg = @"
            С настоящото декларирам, че доброволно желая да участвам във футболен турнир, организиран чрез платформата FootballProjectSoftUni.
            
            1. Декларирам, че съм в добро физическо и здравословно състояние, което ми позволява да участвам в спортни дейности, включително футболни срещи.
            2. Осъзнавам и приемам рисковете, свързани с участието във футболен турнир, включително, но не само: физически наранявания, травми, инциденти и други неблагоприятни събития.
            3. Доброволно поемам всички рискове, свързани с участието ми в турнира, както по време на мачовете, така и извън тях.
            4. Освобождавам от отговорност организаторите, техните представители, партньори и служители от всякаква отговорност за вреди, наранявания, загуби или щети, възникнали в резултат на моето участие, доколкото това е допустимо от приложимото законодателство.
            5. Декларирам, че ще спазвам правилата на турнира, както и указанията на организаторите и съдиите.
            6. Съгласявам се личните ми данни да бъдат обработвани за целите на организацията на турнира и плащането.
            7. Декларирам, че съм прочел/а и разбрал/а настоящата декларация и я приемам доброволно.
            ";
    }
}
